In [3]:
!pip install pymysql

Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/0c/94/e4181a1f6286f545507528c78016e00065ea913276888db2262507693ce5/PyMySQL-1.1.1-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   --------- ------------------------------ 10.2/45.0 kB ? eta -:--:--
   --------------------------- ------------ 30.7/45.0 kB 262.6 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 373.5 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [5]:
import pymysql
import pandas as pd

# Connect to MySQL database
connection = pymysql.connect(
    host='localhost',  # Replace with your host
    user='root',  # Replace with your username
    password='alameen123',  # Replace with your password
    database='hr'  # Replace with your database name
)

cursor = connection.cursor()

In [7]:
cursor.execute("SELECT * FROM employees")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

     employee_id first_name last_name     email    phone_number   hire_date  \
0            100     Steven      King     SKING    515.123.4567  1987-06-17
1            101      Neena   Kochhar  NKOCHHAR    515.123.4568  1989-09-21
2            102        Lex   De Haan   LDEHAAN    515.123.4569  1993-01-13
3            103  Alexander    Hunold   AHUNOLD    590.423.4567  1990-01-03
4            104      Bruce     Ernst    BERNST    590.423.4568  1991-05-21
..           ...        ...       ...       ...             ...         ...
102          202        Pat       Fay      PFAY    603.123.6666  1997-08-17
103          203      Susan    Mavris   SMAVRIS    515.123.7777  1994-06-07
104          204    Hermann      Baer     HBAER    515.123.8888  1994-06-07
105          205    Shelley   Higgins  SHIGGINS    515.123.8080  1994-06-07
106          206    William     Gietz    WGIETZ  51hr5.123.8181  1994-06-07

         job_id   salary  commission_pct  manager_id  department_id
0       AD_PRES  24000.0             NaN         NaN           90.0
1         AD_VP  17000.0             NaN       100.0           90.0
2         AD_VP  17000.0             NaN       100.0           90.0
3       IT_PROG   9000.0             NaN       102.0           60.0
4       IT_PROG   6000.0             NaN       103.0           60.0
..          ...      ...             ...         ...            ...
102      MK_REP   6000.0             NaN       201.0           20.0
103      HR_REP   6500.0             NaN       101.0           40.0
104      PR_REP  10000.0             NaN       101.0           70.0
105      AC_MGR  12000.0             NaN       101.0          110.0
106  AC_ACCOUNT   8300.0             NaN       205.0          110.0

[107 rows x 11 columns]

In [9]:
cursor.execute("SELECT first_name, last_name, email FROM employees")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "last_name", "email"])
print(df)

    first_name last_name     email
0       Steven      King     SKING
1        Neena   Kochhar  NKOCHHAR
2          Lex   De Haan   LDEHAAN
3    Alexander    Hunold   AHUNOLD
4        Bruce     Ernst    BERNST
..         ...       ...       ...
102        Pat       Fay      PFAY
103      Susan    Mavris   SMAVRIS
104    Hermann      Baer     HBAER
105    Shelley   Higgins  SHIGGINS
106    William     Gietz    WGIETZ

[107 rows x 3 columns]

In [11]:
cursor.execute("SELECT DISTINCT job_title FROM jobs")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["job_title"])
print(df)

                          job_title
0                 Public Accountant
1                Accounting Manager
2          Administration Assistant
3                         President
4     Administration Vice President
5                        Accountant
6                   Finance Manager
7    Human Resources Representative
8                        Programmer
9                 Marketing Manager
10         Marketing Representative
11  Public Relations Representative
12                 Purchasing Clerk
13               Purchasing Manager
14                    Sales Manager
15             Sales Representative
16                   Shipping Clerk
17                      Stock Clerk
18                    Stock Manager

In [13]:
cursor.execute("SELECT COUNT(*) AS total_employees FROM employees")
result = cursor.fetchone()
print(f"Total Employees: {result[0]}")

Total Employees: 107

In [15]:
cursor.execute("SELECT * FROM employees WHERE hire_date > '2015-01-01'")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

Empty DataFrame
Columns: [employee_id, first_name, last_name, email, phone_number, hire_date, job_id, salary, commission_pct, manager_id, department_id]
Index: []

In [17]:
cursor.execute("SELECT * FROM employees WHERE salary > 5000")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

    employee_id   first_name   last_name     email        phone_number  \
0           100       Steven        King     SKING        515.123.4567
1           101        Neena     Kochhar  NKOCHHAR        515.123.4568
2           102          Lex     De Haan   LDEHAAN        515.123.4569
3           103    Alexander      Hunold   AHUNOLD        590.423.4567
4           104        Bruce       Ernst    BERNST        590.423.4568
5           108        Nancy   Greenberg  NGREENBE        515.124.4569
6           109       Daniel      Faviet   DFAVIET        515.124.4169
7           110         John        Chen     JCHEN        515.124.4269
8           111       Ismael     Sciarra  ISCIARRA        515.124.4369
9           112  Jose Manuel       Urman   JMURMAN        515.124.4469
10          113         Luis        Popp     LPOPP        515.124.4567
11          114          Den    Raphaely  DRAPHEAL        515.127.4561
12          120      Matthew       Weiss    MWEISS        650.123.1234
13          121         Adam       Fripp    AFRIPP        650.123.2234
14          122        Payam    Kaufling  PKAUFLIN        650.123.3234
15          123       Shanta     Vollman  SVOLLMAN        650.123.4234
16          124        Kevin     Mourgos  KMOURGOS        650.123.5234
17          145         John     Russell   JRUSSEL  011.44.1344.429268
18          146        Karen    Partners  KPARTNER  011.44.1344.467268
19          147      Alberto   Errazuriz  AERRAZUR  011.44.1344.429278
20          148       Gerald   Cambrault  GCAMBRAU  011.44.1344.619268
21          149        Eleni     Zlotkey  EZLOTKEY  011.44.1344.429018
22          150        Peter      Tucker   PTUCKER  011.44.1344.129268
23          151        David   Bernstein  DBERNSTE  011.44.1344.345268
24          152        Peter        Hall     PHALL  011.44.1344.478968
25          153  Christopher       Olsen    COLSEN  011.44.1344.498718
26          154      Nanette   Cambrault  NCAMBRAU  011.44.1344.987668
27          155       Oliver     Tuvault  OTUVAULT  011.44.1344.486508
28          156      Janette        King     JKING  011.44.1345.429268
29          157      Patrick       Sully    PSULLY  011.44.1345.929268
30          158        Allan      McEwen   AMCEWEN  011.44.1345.829268
31          159      Lindsey       Smith    LSMITH  011.44.1345.729268
32          160       Louise       Doran    LDORAN  011.44.1345.629268
33          161       Sarath      Sewall   SSEWALL  011.44.1345.529268
34          162        Clara     Vishney  CVISHNEY  011.44.1346.129268
35          163     Danielle      Greene   DGREENE  011.44.1346.229268
36          164       Mattea     Marvins  MMARVINS  011.44.1346.329268
37          165        David         Lee      DLEE  011.44.1346.529268
38          166       Sundar        Ande     SANDE  011.44.1346.629268
39          167         Amit       Banda    ABANDA  011.44.1346.729268
40          168         Lisa        Ozer     LOZER  011.44.1343.929268
41          169     Harrison       Bloom    HBLOOM  011.44.1343.829268
42          170       Tayler         Fox      TFOX  011.44.1343.729268
43          171      William       Smith    WSMITH  011.44.1343.629268
44          172    Elizabeth       Bates    EBATES  011.44.1343.529268
45          173      Sundita       Kumar    SKUMAR  011.44.1343.329268
46          174        Ellen        Abel     EABEL  011.44.1644.429267
47          175       Alyssa      Hutton   AHUTTON  011.44.1644.429266
48          176     Jonathon      Taylor   JTAYLOR  011.44.1644.429265
49          177         Jack  Livingston  JLIVINGS  011.44.1644.429264
50          178    Kimberely       Grant    KGRANT  011.44.1644.429263
51          179      Charles     Johnson  CJOHNSON  011.44.1644.429262
52          201      Michael   Hartstein  MHARTSTE        515.123.5555
53          202          Pat         Fay      PFAY        603.123.6666
54          203        Susan      Mavris   SMAVRIS        515.123.7777
55          204      Hermann        Baer     HBAER        515.123.8888
56          205      Shelley     Higgins  SHIGGINS        515.123.8080
57          206      William       Gietz    WGIETZ      51hr5.123.8181

     hire_date      job_id   salary  commission_pct  manager_id  department_id
0   1987-06-17     AD_PRES  24000.0             NaN         NaN           90.0
1   1989-09-21       AD_VP  17000.0             NaN       100.0           90.0
2   1993-01-13       AD_VP  17000.0             NaN       100.0           90.0
3   1990-01-03     IT_PROG   9000.0             NaN       102.0           60.0
4   1991-05-21     IT_PROG   6000.0             NaN       103.0           60.0
5   1994-08-17      FI_MGR  12000.0             NaN       101.0          100.0
6   1994-08-16  FI_ACCOUNT   9000.0             NaN       108.0          100.0
7   1997-09-28  FI_ACCOUNT   8200.0             NaN       108.0          100.0
8   1997-09-30  FI_ACCOUNT   7700.0             NaN       108.0          100.0
9   1998-03-07  FI_ACCOUNT   7800.0             NaN       108.0          100.0
10  1999-12-07  FI_ACCOUNT   6900.0             NaN       108.0          100.0
11  1994-12-07      PU_MAN  11000.0             NaN       100.0           30.0
12  1996-07-18      ST_MAN   8000.0             NaN       100.0           50.0
13  1997-04-10      ST_MAN   8200.0             NaN       100.0           50.0
14  1995-05-01      ST_MAN   7900.0             NaN       100.0           50.0
15  1997-10-10      ST_MAN   6500.0             NaN       100.0           50.0
16  1999-11-16      ST_MAN   5800.0             NaN       100.0           50.0
17  1996-10-01      SA_MAN  14000.0            0.40       100.0           80.0
18  1997-01-05      SA_MAN  13500.0            0.30       100.0           80.0
19  1997-03-10      SA_MAN  12000.0            0.30       100.0           80.0
20  1999-10-15      SA_MAN  11000.0            0.30       100.0           80.0
21  2000-01-29      SA_MAN  10500.0            0.20       100.0           80.0
22  1997-01-30      SA_REP  10000.0            0.30       145.0           80.0
23  1997-03-24      SA_REP   9500.0            0.25       145.0           80.0
24  1997-08-20      SA_REP   9000.0            0.25       145.0           80.0
25  1998-03-30      SA_REP   8000.0            0.20       145.0           80.0
26  1998-12-09      SA_REP   7500.0            0.20       145.0           80.0
27  1999-11-23      SA_REP   7000.0            0.15       145.0           80.0
28  1996-01-30      SA_REP  10000.0            0.35       146.0           80.0
29  1996-03-04      SA_REP   9500.0            0.35       146.0           80.0
30  1996-08-01      SA_REP   9000.0            0.35       146.0           80.0
31  1997-03-10      SA_REP   8000.0            0.30       146.0           80.0
32  1997-12-15      SA_REP   7500.0            0.30       146.0           80.0
33  1998-11-03      SA_REP   7000.0            0.25       146.0           80.0
34  1997-11-11      SA_REP  10500.0            0.25       147.0           80.0
35  1999-03-19      SA_REP   9500.0            0.15       147.0           80.0
36  2000-01-24      SA_REP   7200.0            0.10       147.0           80.0
37  2000-02-23      SA_REP   6800.0            0.10       147.0           80.0
38  2000-03-24      SA_REP   6400.0            0.10       147.0           80.0
39  2000-04-21      SA_REP   6200.0            0.10       147.0           80.0
40  1997-03-11      SA_REP  11500.0            0.25       148.0           80.0
41  1998-03-23      SA_REP  10000.0            0.20       148.0           80.0
42  1998-01-24      SA_REP   9600.0            0.20       148.0           80.0
43  1999-02-23      SA_REP   7400.0            0.15       148.0           80.0
44  1999-03-24      SA_REP   7300.0            0.15       148.0           80.0
45  2000-04-21      SA_REP   6100.0            0.10       148.0           80.0
46  1996-05-11      SA_REP  11000.0            0.30       149.0           80.0
47  1997-03-19      SA_REP   8800.0            0.25       149.0           80.0
48  1998-03-24      SA_REP   8600.0            0.20       149.0           80.0
49  1998-04-23      SA_REP   8400.0            0.20       149.0           80.0
50  1999-05-24      SA_REP   7000.0            0.15       149.0            NaN
51  2000-01-04      SA_REP   6200.0            0.10       149.0           80.0
52  1996-02-17      MK_MAN  13000.0             NaN       100.0           20.0
53  1997-08-17      MK_REP   6000.0             NaN       201.0           20.0
54  1994-06-07      HR_REP   6500.0             NaN       101.0           40.0
55  1994-06-07      PR_REP  10000.0             NaN       101.0           70.0
56  1994-06-07      AC_MGR  12000.0             NaN       101.0          110.0
57  1994-06-07  AC_ACCOUNT   8300.0             NaN       205.0          110.0

In [19]:
cursor.execute("""
    SELECT e.*, j.job_title
    FROM employees e
    JOIN jobs j ON e.job_id = j.job_id
    WHERE j.job_title LIKE '%Manager%'
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

    employee_id first_name  last_name     email        phone_number  \
0           205    Shelley    Higgins  SHIGGINS        515.123.8080
1           108      Nancy  Greenberg  NGREENBE        515.124.4569
2           201    Michael  Hartstein  MHARTSTE        515.123.5555
3           114        Den   Raphaely  DRAPHEAL        515.127.4561
4           145       John    Russell   JRUSSEL  011.44.1344.429268
5           146      Karen   Partners  KPARTNER  011.44.1344.467268
6           147    Alberto  Errazuriz  AERRAZUR  011.44.1344.429278
7           148     Gerald  Cambrault  GCAMBRAU  011.44.1344.619268
8           149      Eleni    Zlotkey  EZLOTKEY  011.44.1344.429018
9           120    Matthew      Weiss    MWEISS        650.123.1234
10          121       Adam      Fripp    AFRIPP        650.123.2234
11          122      Payam   Kaufling  PKAUFLIN        650.123.3234
12          123     Shanta    Vollman  SVOLLMAN        650.123.4234
13          124      Kevin    Mourgos  KMOURGOS        650.123.5234

     hire_date  job_id   salary  commission_pct  manager_id  department_id  \
0   1994-06-07  AC_MGR  12000.0             NaN         101            110
1   1994-08-17  FI_MGR  12000.0             NaN         101            100
2   1996-02-17  MK_MAN  13000.0             NaN         100             20
3   1994-12-07  PU_MAN  11000.0             NaN         100             30
4   1996-10-01  SA_MAN  14000.0             0.4         100             80
5   1997-01-05  SA_MAN  13500.0             0.3         100             80
6   1997-03-10  SA_MAN  12000.0             0.3         100             80
7   1999-10-15  SA_MAN  11000.0             0.3         100             80
8   2000-01-29  SA_MAN  10500.0             0.2         100             80
9   1996-07-18  ST_MAN   8000.0             NaN         100             50
10  1997-04-10  ST_MAN   8200.0             NaN         100             50
11  1995-05-01  ST_MAN   7900.0             NaN         100             50
12  1997-10-10  ST_MAN   6500.0             NaN         100             50
13  1999-11-16  ST_MAN   5800.0             NaN         100             50

             job_title
0   Accounting Manager
1      Finance Manager
2    Marketing Manager
3   Purchasing Manager
4        Sales Manager
5        Sales Manager
6        Sales Manager
7        Sales Manager
8        Sales Manager
9        Stock Manager
10       Stock Manager
11       Stock Manager
12       Stock Manager
13       Stock Manager

In [21]:
cursor.execute("SELECT * FROM employees WHERE first_name LIKE 'A%n'")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

   employee_id first_name last_name    email        phone_number   hire_date  \
0          158      Allan    McEwen  AMCEWEN  011.44.1345.829268  1996-08-01

   job_id  salary  commission_pct  manager_id  department_id
0  SA_REP  9000.0            0.35         146             80

In [23]:
cursor.execute("SELECT * FROM employees WHERE commission_pct IS NULL")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

    employee_id first_name last_name     email    phone_number   hire_date  \
0           100     Steven      King     SKING    515.123.4567  1987-06-17
1           101      Neena   Kochhar  NKOCHHAR    515.123.4568  1989-09-21
2           102        Lex   De Haan   LDEHAAN    515.123.4569  1993-01-13
3           103  Alexander    Hunold   AHUNOLD    590.423.4567  1990-01-03
4           104      Bruce     Ernst    BERNST    590.423.4568  1991-05-21
..          ...        ...       ...       ...             ...         ...
67          202        Pat       Fay      PFAY    603.123.6666  1997-08-17
68          203      Susan    Mavris   SMAVRIS    515.123.7777  1994-06-07
69          204    Hermann      Baer     HBAER    515.123.8888  1994-06-07
70          205    Shelley   Higgins  SHIGGINS    515.123.8080  1994-06-07
71          206    William     Gietz    WGIETZ  51hr5.123.8181  1994-06-07

        job_id   salary commission_pct  manager_id  department_id
0      AD_PRES  24000.0           None         NaN             90
1        AD_VP  17000.0           None       100.0             90
2        AD_VP  17000.0           None       100.0             90
3      IT_PROG   9000.0           None       102.0             60
4      IT_PROG   6000.0           None       103.0             60
..         ...      ...            ...         ...            ...
67      MK_REP   6000.0           None       201.0             20
68      HR_REP   6500.0           None       101.0             40
69      PR_REP  10000.0           None       101.0             70
70      AC_MGR  12000.0           None       101.0            110
71  AC_ACCOUNT   8300.0           None       205.0            110

[72 rows x 11 columns]

In [25]:
cursor.execute("SELECT * FROM employees ORDER BY salary DESC LIMIT 5")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df)

   employee_id first_name last_name     email        phone_number   hire_date  \
0          100     Steven      King     SKING        515.123.4567  1987-06-17
1          101      Neena   Kochhar  NKOCHHAR        515.123.4568  1989-09-21
2          102        Lex   De Haan   LDEHAAN        515.123.4569  1993-01-13
3          145       John   Russell   JRUSSEL  011.44.1344.429268  1996-10-01
4          146      Karen  Partners  KPARTNER  011.44.1344.467268  1997-01-05

    job_id   salary  commission_pct  manager_id  department_id
0  AD_PRES  24000.0             NaN         NaN             90
1    AD_VP  17000.0             NaN       100.0             90
2    AD_VP  17000.0             NaN       100.0             90
3   SA_MAN  14000.0             0.4       100.0             80
4   SA_MAN  13500.0             0.3       100.0             80

In [27]:
cursor.execute("SELECT AVG(salary) AS avg_salary FROM employees")
result = cursor.fetchone()
print(f"Average Salary: {result[0]}")

Average Salary: 6461.682242990654

In [29]:
cursor.execute("""
    SELECT d.department_name, COUNT(e.employee_id) AS employee_count
    FROM departments d
    LEFT JOIN employees e ON d.department_id = e.department_id
    GROUP BY d.department_name
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["department_name", "employee_count"])
print(df)

         department_name  employee_count
0         Administration               1
1              Marketing               2
2             Purchasing               6
3        Human Resources               1
4               Shipping              45
5                     IT               5
6       Public Relations               1
7                  Sales              34
8              Executive               3
9                Finance               6
10            Accounting               2
11              Treasury               0
12         Corporate Tax               0
13    Control And Credit               0
14  Shareholder Services               0
15              Benefits               0
16         Manufacturing               0
17          Construction               0
18           Contracting               0
19            Operations               0
20            IT Support               0
21                   NOC               0
22           IT Helpdesk               0
23      Government Sales               0
24          Retail Sales               0
25            Recruiting               0
26               Payroll               0

In [31]:
cursor.execute("SELECT first_name, LENGTH(first_name) AS name_length FROM employees")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "name_length"])
print(df)

    first_name  name_length
0       Steven            6
1        Neena            5
2          Lex            3
3    Alexander            9
4        Bruce            5
..         ...          ...
102        Pat            3
103      Susan            5
104    Hermann            7
105    Shelley            7
106    William            7

[107 rows x 2 columns]

In [33]:
cursor.execute("SELECT first_name, last_name, YEAR(hire_date) AS hire_year FROM employees")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "last_name", "hire_year"])
print(df)

    first_name last_name  hire_year
0       Steven      King       1987
1        Neena   Kochhar       1989
2          Lex   De Haan       1993
3    Alexander    Hunold       1990
4        Bruce     Ernst       1991
..         ...       ...        ...
102        Pat       Fay       1997
103      Susan    Mavris       1994
104    Hermann      Baer       1994
105    Shelley   Higgins       1994
106    William     Gietz       1994

[107 rows x 3 columns]

In [37]:
cursor.execute("""
    SELECT j.job_title, MIN(e.salary) AS min_salary, MAX(e.salary) AS max_salary
    FROM employees e
    JOIN jobs j ON e.job_id = j.job_id
    GROUP BY j.job_title
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["job_title", "min_salary", "max_salary"])
print(df)

                          job_title  min_salary  max_salary
0                 Public Accountant      8300.0      8300.0
1                Accounting Manager     12000.0     12000.0
2          Administration Assistant      4400.0      4400.0
3                         President     24000.0     24000.0
4     Administration Vice President     17000.0     17000.0
5                        Accountant      6900.0      9000.0
6                   Finance Manager     12000.0     12000.0
7    Human Resources Representative      6500.0      6500.0
8                        Programmer      4200.0      9000.0
9                 Marketing Manager     13000.0     13000.0
10         Marketing Representative      6000.0      6000.0
11  Public Relations Representative     10000.0     10000.0
12                 Purchasing Clerk      2500.0      3100.0
13               Purchasing Manager     11000.0     11000.0
14                    Sales Manager     10500.0     14000.0
15             Sales Representative      6100.0     11500.0
16                   Shipping Clerk      2500.0      4200.0
17                      Stock Clerk      2100.0      3600.0
18                    Stock Manager      5800.0      8200.0

In [39]:
cursor.execute("""
    SELECT e.first_name, e.last_name, d.department_name
    FROM employees e
    JOIN departments d ON e.department_id = d.department_id
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "last_name", "department_name"])
print(df)

      first_name  last_name department_name
0       Jennifer     Whalen  Administration
1        Michael  Hartstein       Marketing
2            Pat        Fay       Marketing
3            Den   Raphaely      Purchasing
4      Alexander       Khoo      Purchasing
..           ...        ...             ...
101       Ismael    Sciarra         Finance
102  Jose Manuel      Urman         Finance
103         Luis       Popp         Finance
104      Shelley    Higgins      Accounting
105      William      Gietz      Accounting

[106 rows x 3 columns]

In [41]:
cursor.execute("""
    SELECT e.first_name, e.last_name, j.job_title, l.city
    FROM employees e
    JOIN jobs j ON e.job_id = j.job_id
    JOIN departments d ON e.department_id = d.department_id
    JOIN locations l ON d.location_id = l.location_id
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "last_name", "job_title", "city"])
print(df)

    first_name last_name                      job_title                 city
0      William     Gietz              Public Accountant              Seattle
1      Shelley   Higgins             Accounting Manager              Seattle
2     Jennifer    Whalen       Administration Assistant              Seattle
3       Steven      King                      President              Seattle
4        Neena   Kochhar  Administration Vice President              Seattle
..         ...       ...                            ...                  ...
101    Matthew     Weiss                  Stock Manager  South San Francisco
102       Adam     Fripp                  Stock Manager  South San Francisco
103      Payam  Kaufling                  Stock Manager  South San Francisco
104     Shanta   Vollman                  Stock Manager  South San Francisco
105      Kevin   Mourgos                  Stock Manager  South San Francisco

[106 rows x 4 columns]

In [43]:
cursor.execute("""
    SELECT d.department_name, COUNT(e.employee_id) AS employee_count
    FROM departments d
    LEFT JOIN employees e ON d.department_id = e.department_id
    GROUP BY d.department_name
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["department_name", "employee_count"])
print(df)

         department_name  employee_count
0         Administration               1
1              Marketing               2
2             Purchasing               6
3        Human Resources               1
4               Shipping              45
5                     IT               5
6       Public Relations               1
7                  Sales              34
8              Executive               3
9                Finance               6
10            Accounting               2
11              Treasury               0
12         Corporate Tax               0
13    Control And Credit               0
14  Shareholder Services               0
15              Benefits               0
16         Manufacturing               0
17          Construction               0
18           Contracting               0
19            Operations               0
20            IT Support               0
21                   NOC               0
22           IT Helpdesk               0
23      Government Sales               0
24          Retail Sales               0
25            Recruiting               0
26               Payroll               0

In [45]:
cursor.execute("""
    SELECT e1.first_name, e1.last_name, e1.job_id
    FROM employees e1
    JOIN employees e2 ON e1.manager_id = e2.employee_id
    WHERE e1.job_id = e2.job_id
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "last_name", "job_id"])
print(df)

  first_name  last_name   job_id
0      Bruce      Ernst  IT_PROG
1      David     Austin  IT_PROG
2      Valli  Pataballa  IT_PROG
3      Diana    Lorentz  IT_PROG

In [47]:
cursor.execute("""
    SELECT DISTINCT e.first_name, e.last_name
    FROM employees e
    JOIN job_history jh ON e.employee_id = jh.employee_id
    WHERE jh.job_id != e.job_id
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=["first_name", "last_name"])
print(df)

  first_name  last_name
0      Neena    Kochhar
1   Jennifer     Whalen
2        Lex    De Haan
3    Michael  Hartstein
4   Jonathon     Taylor
5        Den   Raphaely
6      Payam   Kaufling

In [49]:
cursor.close()
connection.close()